In [1]:
print("Hola Mundo, esta es mi primera incursión en Python")

Hola Mundo, esta es mi primera incursión en Python

In [3]:
nombre = "Felipe"
edad = "30"
actividades = ["entrenar","moto","estudiar"]
mascotas = False

In [6]:
print(nombre, type(nombre))
print(edad,type(edad))
print(actividades[1],type(actividades))
print(mascotas,type(mascotas))

Felipe <class 'str'>
30 <class 'str'>
moto <class 'list'>
False <class 'bool'>

In [66]:
print("Mi nombre es "+ nombre+" , mi edad es "+ edad+" , mis actividades favoritas son "+ actividades[0]+" , "+actividades[1] +" , "+ actividades[2]+" y actualmente mi mascota es "+ str(mascotas))

Mi nombre es Felipe , mi edad es 20 , mis actividades favoritas son entrenar , moto , estudiar y actualmente mi mascota es False

In [12]:
print('Estaba la pájara pinta sentada en el verde limón') #falta comilla de cierre

Estaba la pájara pinta sentada en el verde limón

In [20]:
name="felipe"
edad = "20"
print('Mi nombre es '+ name +' y tengo '+ edad +' ,años') #falta concatenar str, variables no creadas y "," fuera de ""

Mi nombre es felipe y tengo 20 ,años

In [26]:
import pandas as pd #mal escrito nombre libreria
import numpy as np #mal escrito nombre libreria

In [24]:
"Ornitorrinco" + str(45) #transformar formato de int a str

'Ornitorrinco45'

In [27]:
import pandas as pd
import numpy as np

In [30]:
df = pd.read_csv("flights.csv")

In [31]:
df.head(5)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [32]:
df.tail(5)

     year      month  passengers
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

In [35]:
df.year.describe()

count     144.000000
mean     1954.500000
std         3.464102
min      1949.000000
25%      1951.750000
50%      1954.500000
75%      1957.250000
max      1960.000000
Name: year, dtype: float64

In [40]:
df["year"].value_counts()

1960    12
1959    12
1958    12
1957    12
1956    12
1955    12
1954    12
1953    12
1952    12
1951    12
1950    12
1949    12
Name: year, dtype: int64

In [43]:
primeras = df.head(15)
primeras

    year      month  passengers
0   1949    January         112
1   1949   February         118
2   1949      March         132
3   1949      April         129
4   1949        May         121
5   1949       June         135
6   1949       July         148
7   1949     August         148
8   1949  September         136
9   1949    October         119
10  1949   November         104
11  1949   December         118
12  1950    January         115
13  1950   February         126
14  1950      March         141

In [42]:
primeras

    year      month  passengers
0   1949    January         112
1   1949   February         118
2   1949      March         132
3   1949      April         129
4   1949        May         121
5   1949       June         135
6   1949       July         148
7   1949     August         148
8   1949  September         136
9   1949    October         119
10  1949   November         104
11  1949   December         118
12  1950    January         115
13  1950   February         126
14  1950      March         141

In [44]:
ultimas = df.tail(15)
ultimas

     year      month  passengers
129  1959    October         407
130  1959   November         362
131  1959   December         405
132  1960    January         417
133  1960   February         391
134  1960      March         419
135  1960      April         461
136  1960        May         472
137  1960       June         535
138  1960       July         622
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

In [47]:
media = np.mean(df["passengers"])
media #promedio de pasajeros en todo el dataset

280.2986111111111

In [49]:
mediana = np.median(df["passengers"])
mediana # valor central del dataset

265.5

In [50]:
desv = np.std(df["passengers"])
desv # la cantidad de pasajeros que se desvia del promedio + o -

119.54904153277148

In [56]:
valores =  (np.mean(ultimas["passengers"]), np.median(ultimas["passengers"]), np.std(ultimas["passengers"]))
valores # el promedio son 459 pasajeros, se centra en 432 pasajeros y tienen una desviacion de 75 pasajeros, esto es en los 15 datos finales

(459.2, 432.0, 75.29426715671431)

In [57]:
valores =  (np.mean(primeras["passengers"]), np.median(primeras["passengers"]), np.std(primeras["passengers"]))
valores

(126.8, 126.0, 12.681745410891462)